README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-21 Thu 23:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pubmed parser</title>
<meta name="author" content="David R. Connell" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Pubmed parser</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#structure-file">1. Structure file</a></li>
<li><a href="#example-creating-node-and-edges">2. Example: creating node and edge files for importing with neo4j</a>
<ul>
<li><a href="#org4b301de">2.1. Generating node files</a></li>
<li><a href="#orgb1db7a1">2.2. Generating edge files</a></li>
<li><a href="#orgdd78b6b">2.3. Joining key's features to key</a></li>
<li><a href="#orga19c765">2.4. Cleaning up (replacing temporary separators)</a></li>
<li><a href="#orgac9c7f8">2.5. Adding headers</a></li>
</ul>
</li>
<li><a href="#example-overlap">3. <span class="todo TODO">TODO</span> Example: calculating overlap</a></li>
<li><a href="#orgfcedd02">4. Example: importing with neo4j</a></li>
</ul>
</div>
</div>
<p>
Read XML files and pull out selected values.
Values to collect are determined by paths found in a <a href="#structure-file">structure file</a>.
The structure file also includes a key which associates the values with a parent element and names, which determine which file to place the elements in.
</p>

<p>
Files can be passed as either gzipped or uncompressed XML files or from standard in.
</p>

<p>
For more info on Pubmed's XML files see: <a href="https://dtd.nlm.nih.gov/ncbi/pubmed/doc/out/190101/index.html">pubmed_190101.dtd.</a>
</p>

<p>
Usage:
</p>
<div class="org-src-container">
<pre class="src src-sh">xml_read --cache-dir=cache --structure-file=structure.yml <span style="color: #FFAB91;">\</span>
    data/*.xml.gz
</pre>
</div>

<p>
The cache directory is where the results are stored.
</p>

<p>
Build:
Requires <code>zlib</code>
</p>
<div class="org-src-container">
<pre class="src src-sh">make all
</pre>
</div>

<div id="outline-container-structure-file" class="outline-2">
<h2 id="structure-file"><span class="section-number-2">1.</span> Structure file</h2>
<div class="outline-text-2" id="text-structure-file">
<p>
The structure file is a YAML file containing key-value pairs for different tags and paths.
There are four required keys: <code>root</code>, <code>key</code>, <code>key_features</code>, and <code>nodes</code>.
<code>Root</code> provide the top-level tag, in the case of the pubmed files this will be <code>PubmedArticleSet</code>.
</p>

<div class="org-src-container">
<pre class="src src-sh">root: <span style="color: #FFAB91;">"PubmedArticleSet"</span>
</pre>
</div>

<p>
Only tags below the root tag will be considered.
</p>

<p>
<code>Key</code> is a reference tag.
In the pubmed case all data is with respect to a publication, so the key should identify the publication the values are linked to.
The <code>PMID</code> tag is a suitable candidate.
</p>

<div class="org-src-container">
<pre class="src src-sh">key: <span style="color: #000000;">{</span>
  Publication: <span style="color: #FFAB91;">"/PubmedArticle/MedlineCitation/PMID"</span>
<span style="color: #000000;">}</span>
</pre>
</div>

<p>
Unlike <code>root</code>, the value of <code>key</code> should be a map.
In the example above, <code>key</code> is named publication and it's value is an XML path.
The name is used to determine the file to write <code>PMID</code> values to.
This file acts as a reference for all publications seen, even those for which no other value was found.
Key's value is a path indicating where to find the desired tag in the XML hierarchy.
All paths start after the root.
</p>

<p>
Both <code>key_features</code> and <code>nodes</code> determine the other values to collect.
The <code>read_xml</code> program does not distinguish between them, but it is useful for post-processing the data if we keep them separate (see <a href="#example-creating-node-and-edges">2</a>).
<code>Key_features</code> is for values that are apart of the key's node.
For instance, the date of publication is specific to the publication, all publications have one, and only one, publication date.
<code>Nodes</code> handles other values that characterize a publication but are can have any number (including 0) of instances, such as references and authors.
These make up distinct node type (i.e. a given author is a node of type author which can be connected to various other nodes such as the publications that author contributed to).
</p>

<div class="org-src-container">
<pre class="src src-sh">key_features: <span style="color: #000000;">{</span>
  Year: <span style="color: #FFAB91;">"/PubmedArticle/MedlineCitation/Article/Journal/JournalIssue/PubDate/Year"</span>,
  Language: <span style="color: #FFAB91;">"/PubmedArticle/MedlineCitation/Article/Language"</span>
<span style="color: #000000;">}</span>

nodes: <span style="color: #000000;">{</span>
  Author: <span style="color: #FFAB91;">"/PubmedArticle/MedlineCitation/Article/AuthorList/Author/{LastName,ForeName}"</span>,
  Grant: <span style="color: #FFAB91;">"/PubmedArticle/MedlineCitation/Article/GrantList/Grant/GrantID"</span>,
  Chemical: <span style="color: #FFAB91;">"/PubmedArticle/MedlineCitation/ChemicalList/Chemical/NameOfSubstance/@UI"</span>,
  Qualifier: <span style="color: #FFAB91;">"/PubmedArticle/MedlineCitation/MeshHeadingList/MeshHeading/QualifierName/@UI"</span>,
  Descriptor: <span style="color: #FFAB91;">"/PubmedArticle/MedlineCitation/MeshHeadingList/MeshHeading/DescriptorName/@UI"</span>,
  Reference: <span style="color: #FFAB91;">"/PubmedArticle/PubmedData/ReferenceList/Reference/ArticleIdList/ArticleId/[@IdType='pubmed']"</span>
<span style="color: #000000;">}</span>
</pre>
</div>

<p>
In the above example there is some special syntax.
For <code>author</code> multiple values are returned each time the <code>author</code> tag is found.
This is expressed by using the <code>{child_tag1,child_tag2,...}</code> notation.
Each child tag under the parent tag is collected and returned in a single row, represented multiple node features.
This notation prevents mismatches between features of a given node if any tags are missing.
In the case a tag is missing an empty string is printed.
</p>

<p>
To get an attribute from a tag, the <code>@attribute</code> notation is used&#x2014;as in the <code>chemical</code> node.
Whenever a path ends with an attribute <code>xml_read</code> will collect both the attribute and tag value.
</p>

<p>
Lastly, <code>[@attribute='value']</code> filters for attributes with the supplied values.
In the case of <code>reference</code> above this will ensure all references are identified by <code>PMID</code> as opposed to other IDs, such as DOI, so <code>references</code> can be linked with <code>publication</code> nodes.
</p>

<p>
This example structure file can be found in the example directory of this project at: <a href="./example/structure.yml">./example/structure.yml</a>
</p>
</div>
</div>
