README.org
* Example: creating node and edge files for importing with neo4j
:PROPERTIES:
:CUSTOM_ID: example-creating-node-and-edges
:END:

The resulting values can be used to generate node and edge files that work with ~neo4j~.
First step is to set up the environment:

#+begin_src bash :exports none :tangle ./example/process.sh
  #! /usr/bin/env bash
  # Processes Pubmed XML files with read_xml then converts those into
  # node and edge files for use with neo4j.
#+end_src

#+begin_src bash :tangle ./example/process.sh :eval no
  top_dir=../$(dirname $0)
  bin_dir=$top_dir/bin
  cache_dir=~/data/synergy/cache
  data_dir=~/data/pubmed
  structure_file=$top_dir/example/structure.yml
  import_dir=~/data/synergy/import
  delete_cache=false # If true clear cache.
  nthreads=64

  $delete_cache && \
      [ -d $cache_dir ] && \
      rm -r $cache_dir && \
      mkdir -p $cache_dir

  rm -r $import_dir && mkdir -p $import_dir
#+end_src

#+begin_src bash :exports none
  top_dir=$PWD
  bin_dir=$top_dir/bin
  cache_dir=./cache
  data_dir=~/data/pubmed
  structure_file=$top_dir/example/structure.yml
  import_dir=~/data/synergy/import
  nthreads=4
  delete_cache=false # If true clear cache.

  $delete_cache && \
      [ -d $cache_dir ] && \
      rm -r $cache_dir && \
      mkdir -p $cache_dir

  rm -r $import_dir && mkdir -p $import_dir
#+end_src

Within the cache directory is a ~processed.txt~ file which contains a list of all files that have been read.
We can use this to filter out files that have already been read in the case the program has been stopped:

#+begin_src bash :eval no :tangle ./example/process.sh
  if [[ -f $cache_dir/processed.txt ]]; then
      files=$(cat $cache_dir/processed.txt <(ls "$data_dir/*.xml.gz") \
          | sort | uniq -u)
  else
      files="$data_dir/*.xml.gz"
  fi
#+end_src

#+begin_src bash :exports none
  files="$top_dir/data/*.xml.gz"
#+end_src

Then read the files.

#+begin_src bash :tangle ./example/process.sh
  # Assuming the executables are in this directory and not installed globally.
  PATH="$bin_dir:$PATH" OMP_NUM_THREADS="$nthreads" read_xml \
      --structure-file=$structure_file \
      --cache-dir=$cache_dir \
      $files
#+end_src

If ~read_xml~ was run across multiple files, the files are read in parallel and each thread will print to it's own set of files, distinguished by their thread number.
The script ~cat_resuts.sh~ can be used to combine the results across threads so there is one file for each node type.

#+begin_src bash :tangle ./example/process.sh
  $top_dir/cat_results.sh $cache_dir
#+end_src

Now using the ~yaml_get_key_components~ executable, we can read the contents of the structure file into shell and use those to generate ids, create a list of all nodes for each node type, join the nodes with ~key~ to create edge lists, and generate ~neo4j~ style headers.

First, the ~yaml_get_key_components~ can be written into a wrapper function so we don't have to keep passing the same arguments.

#+begin_src bash :tangle ./example/process.sh :results none
  components() {
      local name=$1
      PATH="$bin_dir:$PATH" yaml_get_key_component \
          --structure-file=$structure_file $name
  }
#+end_src

