README.html

<div id="outline-container-example-creating-node-and-edges" class="outline-2">
<h2 id="example-creating-node-and-edges"><span class="section-number-2">2.</span> Example: creating node and edge files for importing with neo4j</h2>
<div class="outline-text-2" id="text-example-creating-node-and-edges">
<p>
The resulting values can be used to generate node and edge files that work with <code>neo4j</code>.
First step is to set up the environment:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #37474F; font-weight: bold;">top_dir</span>=../$<span style="color: #000000;">(</span>dirname $<span style="color: #37474F; font-weight: bold;">0</span><span style="color: #000000;">)</span>
<span style="color: #37474F; font-weight: bold;">bin_dir</span>=$<span style="color: #37474F; font-weight: bold;">top_dir</span>/bin
<span style="color: #37474F; font-weight: bold;">cache_dir</span>=~/Documents/david/data/synergy/cache
<span style="color: #37474F; font-weight: bold;">data_dir</span>=~/Documents/david/data/pubmed
<span style="color: #37474F; font-weight: bold;">structure_file</span>=$<span style="color: #37474F; font-weight: bold;">top_dir</span>/example/structure.yml
<span style="color: #37474F; font-weight: bold;">import_dir</span>=~/Documents/david/data/synergy/import
<span style="color: #37474F; font-weight: bold;">delete_cache</span>=false <span style="color: #B0BEC5;"># </span><span style="color: #B0BEC5;">If true clear cache.</span>
<span style="color: #37474F; font-weight: bold;">nthreads</span>=64

$<span style="color: #37474F; font-weight: bold;">delete_cache</span> &amp;&amp; <span style="color: #FFAB91;">\</span>
    <span style="color: #000000;">[</span> -d $<span style="color: #37474F; font-weight: bold;">cache_dir</span> <span style="color: #000000;">]</span> &amp;&amp; <span style="color: #FFAB91;">\</span>
    rm -r $<span style="color: #37474F; font-weight: bold;">cache_dir</span>

<span style="color: #000000;">[</span> -d $<span style="color: #37474F; font-weight: bold;">import_dir</span> <span style="color: #000000;">]</span> &amp;&amp; rm -r $<span style="color: #37474F; font-weight: bold;">import_dir</span>
mkdir -p $<span style="color: #37474F; font-weight: bold;">import_dir</span>
</pre>
</div>

<p>
Within the cache directory is a <code>processed.txt</code> file which contains a list of all files that have been read.
We can use this to filter out files that have already been read in the case the program has been stopped:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #673AB7;">if</span> <span style="color: #000000;">[</span><span style="color: #a8007f;">[</span> -f $<span style="color: #37474F; font-weight: bold;">cache_dir</span>/processed.txt <span style="color: #a8007f;">]</span><span style="color: #000000;">]</span>; <span style="color: #673AB7;">then</span>
    <span style="color: #37474F; font-weight: bold;">files</span>=$<span style="color: #000000;">(</span>cat $<span style="color: #37474F; font-weight: bold;">cache_dir</span>/processed.txt &lt;<span style="color: #a8007f;">(</span>ls <span style="color: #FFAB91;">"$data_dir/*.xml.gz"</span><span style="color: #a8007f;">)</span> <span style="color: #FFAB91;">\</span>
        | sort | uniq -u<span style="color: #000000;">)</span>
<span style="color: #673AB7;">else</span>
    <span style="color: #37474F; font-weight: bold;">files</span>=<span style="color: #FFAB91;">"$data_dir/*.xml.gz"</span>
<span style="color: #673AB7;">fi</span>
</pre>
</div>

<p>
Then read the files.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #B0BEC5;"># </span><span style="color: #B0BEC5;">Assuming the executables are in this directory and not installed globally.</span>
<span style="color: #37474F; font-weight: bold;">PATH</span>=<span style="color: #FFAB91;">"$bin_dir:$PATH"</span> <span style="color: #37474F; font-weight: bold;">OMP_NUM_THREADS</span>=<span style="color: #FFAB91;">"$nthreads"</span> read_xml <span style="color: #FFAB91;">\</span>
    --structure-file=$<span style="color: #37474F; font-weight: bold;">structure_file</span> <span style="color: #FFAB91;">\</span>
    --cache-dir=$<span style="color: #37474F; font-weight: bold;">cache_dir</span> <span style="color: #FFAB91;">\</span>
    $<span style="color: #37474F; font-weight: bold;">files</span>
</pre>
</div>

<p>
If <code>read_xml</code> was run across multiple files, the files are read in parallel and each thread will print to it's own set of files, distinguished by their thread number.
The script <code>cat_resuts.sh</code> can be used to combine the results across threads so there is one file for each node type.
</p>

<div class="org-src-container">
<pre class="src src-bash">$<span style="color: #37474F; font-weight: bold;">top_dir</span>/cat_results.sh $<span style="color: #37474F; font-weight: bold;">cache_dir</span>
</pre>
</div>

<p>
Now using the <code>yaml_get_key_components</code> executable, we can read the contents of the structure file into shell and use those to generate ids, create a list of all nodes for each node type, join the nodes with <code>key</code> to create edge lists, and generate <code>neo4j</code> style headers.
</p>

<p>
First, the <code>yaml_get_key_components</code> can be written into a wrapper function so we don't have to keep passing the same arguments.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #37474F; font-weight: bold;">components</span><span style="color: #000000;">()</span> <span style="color: #000000;">{</span>
    <span style="color: #673AB7;">local</span> <span style="color: #37474F; font-weight: bold;">name</span>=$<span style="color: #37474F; font-weight: bold;">1</span>
    <span style="color: #37474F; font-weight: bold;">PATH</span>=<span style="color: #FFAB91;">"$bin_dir:$PATH"</span> yaml_get_key_component <span style="color: #FFAB91;">\</span>
        --structure-file=$<span style="color: #37474F; font-weight: bold;">structure_file</span> $<span style="color: #37474F; font-weight: bold;">name</span>
<span style="color: #000000;">}</span>
</pre>
</div>
</div>
