README.org
** Generating node files
To generate nodes we will remove remove the ~PMID~ column, sort, keep the unique rows, then print with line numbers (which will be used as IDs).

#+begin_src bash :tangle ./example/process.sh
  tabsep="=+=t=+=" # Key to keep non-id columns together
  spcsep="=+s+="
  # ${key_value} looks like ${key}: ${value}
  while IFS=': ' read key value; do
      [[ $key == "Reference" ]] && continue
      key_file=$cache_dir/$key.tsv
      paste <(cut -f1 $key_file) \
          <(cut -f1 --complement $key_file | \
          sed -e "s/\\t/$tabsep/g" -e  "s/\\s/$spcsep/g") | \
          sort -k 2 > \
          tmp && mv tmp $key_file

      cut -f1 --complement $key_file | sort -u | \
          cat -n | sed 's/^\s*//' > $import_dir/${key}_nodes.tsv
  done <<< "$(components nodes)"
#+end_src

*Note*: the ~reference~ file is really an edge file (publication--publication edges) so it doesn't make sense to make a node file for it.
Additionally, since both of it's columns are PMIDs they should not be renumbered, instead IDs generated for the ~publication~ nodes will be used to renumber both columns of ~reference~.

The ~key_features~ files will be added to the ~key~ file as another node file but that will be done later to prevent them from getting in the way of joins while creating the edge files.
But before making the edge files, we'll generate IDs for the key file too.
~PMID~ would work as a unique identifier, but by creating a IDs we can ensure the values are a range from 1--~n_publications~ which will make it possible to use as indices for other applications (See [[#example-overlap]]).

*Note*: The publications may reference files outside of the database leading to values in the second column of the reference file to not be included in the publication node file so we have to add them to the cache publication file.

#+begin_src bash :tangle ./example/process.sh
  key_value=$(components key)
  key=${key_value%%:*}
  cat <(cut -f1 $cache_dir/$key.tsv) <(cut -f2 $cache_dir/Reference.tsv) \
      | sort -u | cat -n | sed 's/^\s*//' > $import_dir/${key}_nodes.tsv
#+end_src

The resulting file has the new IDs in column one and the PMIDs in column two.
** Generating edge files
Now we need to join the cache files with their node files to add the node ID columns to the cache files.

#+begin_src bash :tangle ./example/process.sh
  while IFS=': ' read node value; do
      [[ $node == "Reference" ]] && continue
      join -j 2 $cache_dir/${node}.tsv $import_dir/${node}_nodes.tsv | \
          sort -k 2b,2 > $cache_dir/${node}_tmp.tsv
  done <<< "$(components nodes)"
#+end_src

Then to create the edge files, join the publication node file with the cached files on PMID and remove the features so only the IDs are left.

#+begin_src bash :tangle ./example/process.sh
  while IFS=': ' read node value; do
      [[ $node == "Reference" ]] && continue
      join -j 2 $cache_dir/${node}_tmp.tsv $import_dir/${key}_nodes.tsv | \
          awk '{ print $4,"\t",$3 }'> \
          $import_dir/${key}_${node}_edges.tsv
  done <<< "$(components nodes)"
#+end_src

Now replace the PMIDs in the reference file to the new publication IDs by both columns with the publication nodes file.

#+begin_src bash :tangle ./example/process.sh
  paste <(join -1 2 -2 1 $import_dir/${key}_nodes.tsv <(sort -k 1 $cache_dir/Reference.tsv) | cut -d" " -f2) \
      <(join -j 2 $import_dir/${key}_nodes.tsv <(sort -k 2 $cache_dir/Reference.tsv) | cut -d" " -f2) > \
      $import_dir/${key}_${key}_edges.tsv
#+end_src

