README.html

<div id="outline-container-org4b301de" class="outline-3">
<h3 id="org4b301de"><span class="section-number-3">2.1.</span> Generating node files</h3>
<div class="outline-text-3" id="text-2-1">
<p>
To generate nodes we will remove remove the <code>PMID</code> column, sort, keep the unique rows, then print with line numbers (which will be used as IDs).
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #37474F; font-weight: bold;">tabsep</span>=<span style="color: #FFAB91;">"=+=t=+="</span> <span style="color: #B0BEC5;"># </span><span style="color: #B0BEC5;">Key to keep non-id columns together</span>
<span style="color: #37474F; font-weight: bold;">spcsep</span>=<span style="color: #FFAB91;">"=+s+="</span>

<span style="color: #37474F; font-weight: bold;">gen_node</span><span style="color: #000000;">()</span> <span style="color: #000000;">{</span>
    <span style="color: #673AB7;">local</span> <span style="color: #37474F; font-weight: bold;">key</span>=$<span style="color: #37474F; font-weight: bold;">1</span>

    <span style="color: #37474F; font-weight: bold;">key_file</span>=$<span style="color: #37474F; font-weight: bold;">cache_dir</span>/$<span style="color: #37474F; font-weight: bold;">key</span>.tsv
    paste &lt;<span style="color: #a8007f;">(</span>cut -f1 $<span style="color: #37474F; font-weight: bold;">key_file</span><span style="color: #a8007f;">)</span> <span style="color: #FFAB91;">\</span>
        &lt;<span style="color: #a8007f;">(</span>cut -f1 --complement $<span style="color: #37474F; font-weight: bold;">key_file</span> | <span style="color: #FFAB91;">\</span>
        sed -e <span style="color: #FFAB91;">"s/\\t/$tabsep/g"</span> -e  <span style="color: #FFAB91;">"s/\\s/$spcsep/g"</span><span style="color: #a8007f;">)</span> | <span style="color: #FFAB91;">\</span>
        sort -k 2 &gt; <span style="color: #FFAB91;">\</span>
        tmp_$<span style="color: #a8007f;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #a8007f;">}</span> &amp;&amp; mv tmp_$<span style="color: #a8007f;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #a8007f;">}</span> $<span style="color: #37474F; font-weight: bold;">key_file</span>

    cut -f1 --complement $<span style="color: #37474F; font-weight: bold;">key_file</span> | sort -u | <span style="color: #FFAB91;">\</span>
        cat -n | sed <span style="color: #FFAB91;">'s/^\s*//'</span> &gt; $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #a8007f;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #a8007f;">}</span>_nodes.tsv
<span style="color: #000000;">}</span>

<span style="color: #673AB7;">while</span> <span style="color: #37474F; font-weight: bold;">IFS</span>=<span style="color: #FFAB91;">': '</span> read key value; <span style="color: #673AB7;">do</span>
    <span style="color: #000000;">[</span><span style="color: #a8007f;">[</span> $<span style="color: #37474F; font-weight: bold;">key</span> == <span style="color: #FFAB91;">"Reference"</span> <span style="color: #a8007f;">]</span><span style="color: #000000;">]</span> &amp;&amp; <span style="color: #673AB7;">continue</span>
    gen_node $<span style="color: #37474F; font-weight: bold;">key</span> &amp;
<span style="color: #673AB7;">done</span> &lt;&lt;&lt; <span style="color: #FFAB91;">"$(components nodes)"</span>
<span style="color: #673AB7;">wait</span>
</pre>
</div>

<p>
<b>Note</b>: the <code>reference</code> file is really an edge file (publication&#x2013;publication edges) so it doesn't make sense to make a node file for it.
Additionally, since both of it's columns are PMIDs they should not be renumbered, instead IDs generated for the <code>publication</code> nodes will be used to renumber both columns of <code>reference</code>.
</p>

<p>
The <code>key_features</code> files will be added to the <code>key</code> file as another node file but that will be done later to prevent them from getting in the way of joins while creating the edge files.
But before making the edge files, we'll generate IDs for the key file too.
<code>PMID</code> would work as a unique identifier, but by creating a IDs we can ensure the values are a range from 1--<code>n_publications</code> which will make it possible to use as indices for other applications (See <a href="#example-overlap">3</a>).
</p>

<p>
<b>Note</b>: The publications may reference files outside of the database leading to values in the second column of the reference file to not be included in the publication node file so we have to add them to the cache publication file.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #37474F; font-weight: bold;">key_value</span>=$<span style="color: #000000;">(</span>components key<span style="color: #000000;">)</span>
<span style="color: #37474F; font-weight: bold;">key</span>=$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key_value</span>%%:*<span style="color: #000000;">}</span>
cat &lt;<span style="color: #000000;">(</span>cut -f1 $<span style="color: #37474F; font-weight: bold;">cache_dir</span>/$<span style="color: #37474F; font-weight: bold;">key</span>.tsv<span style="color: #000000;">)</span> &lt;<span style="color: #000000;">(</span>cut -f2 $<span style="color: #37474F; font-weight: bold;">cache_dir</span>/Reference.tsv<span style="color: #000000;">)</span> <span style="color: #FFAB91;">\</span>
    | sort -u | cat -n | sed <span style="color: #FFAB91;">'s/^\s*//'</span> &gt; $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_nodes.tsv
</pre>
</div>

<p>
The resulting file has the new IDs in column one and the PMIDs in column two.
</p>
</div>
</div>
<div id="outline-container-orgb1db7a1" class="outline-3">
<h3 id="orgb1db7a1"><span class="section-number-3">2.2.</span> Generating edge files</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Now we need to join the cache files with their node files to add the node ID columns to the cache files.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #673AB7;">while</span> <span style="color: #37474F; font-weight: bold;">IFS</span>=<span style="color: #FFAB91;">': '</span> read node value; <span style="color: #673AB7;">do</span>
    <span style="color: #000000;">[</span><span style="color: #a8007f;">[</span> $<span style="color: #37474F; font-weight: bold;">node</span> == <span style="color: #FFAB91;">"Reference"</span> <span style="color: #a8007f;">]</span><span style="color: #000000;">]</span> &amp;&amp; <span style="color: #673AB7;">continue</span>
    join -j 2 $<span style="color: #37474F; font-weight: bold;">cache_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">node</span><span style="color: #000000;">}</span>.tsv $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">node</span><span style="color: #000000;">}</span>_nodes.tsv | <span style="color: #FFAB91;">\</span>
        sort -k 2b,2 &gt; $<span style="color: #37474F; font-weight: bold;">cache_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">node</span><span style="color: #000000;">}</span>_tmp.tsv &amp;
<span style="color: #673AB7;">done</span> &lt;&lt;&lt; <span style="color: #FFAB91;">"$(components nodes)"</span>
<span style="color: #673AB7;">wait</span>
</pre>
</div>

<p>
Then to create the edge files, join the publication node file with the cached files on PMID and remove the features so only the IDs are left.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #673AB7;">while</span> <span style="color: #37474F; font-weight: bold;">IFS</span>=<span style="color: #FFAB91;">': '</span> read node value; <span style="color: #673AB7;">do</span>
    <span style="color: #000000;">[</span><span style="color: #a8007f;">[</span> $<span style="color: #37474F; font-weight: bold;">node</span> == <span style="color: #FFAB91;">"Reference"</span> <span style="color: #a8007f;">]</span><span style="color: #000000;">]</span> &amp;&amp; <span style="color: #673AB7;">continue</span>
    join -j 2 $<span style="color: #37474F; font-weight: bold;">cache_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">node</span><span style="color: #000000;">}</span>_tmp.tsv $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_nodes.tsv | <span style="color: #FFAB91;">\</span>
        awk <span style="color: #FFAB91;">'{ print $4,"\t",$3 }'</span>&gt; <span style="color: #FFAB91;">\</span>
        $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">node</span><span style="color: #000000;">}</span>_edges.tsv &amp;
<span style="color: #673AB7;">done</span> &lt;&lt;&lt; <span style="color: #FFAB91;">"$(components nodes)"</span>
<span style="color: #673AB7;">wait</span>
</pre>
</div>

<p>
Now replace the PMIDs in the reference file to the new publication IDs by both columns with the publication nodes file.
</p>

<div class="org-src-container">
<pre class="src src-bash">paste &lt;<span style="color: #000000;">(</span>join -1 2 -2 1 $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #a8007f;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #a8007f;">}</span>_nodes.tsv &lt;<span style="color: #a8007f;">(</span>sort -k 1 $<span style="color: #37474F; font-weight: bold;">cache_dir</span>/Reference.tsv<span style="color: #a8007f;">)</span> | cut -d<span style="color: #FFAB91;">" "</span> -f2<span style="color: #000000;">)</span> <span style="color: #FFAB91;">\</span>
    &lt;<span style="color: #000000;">(</span>join -j 2 $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #a8007f;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #a8007f;">}</span>_nodes.tsv &lt;<span style="color: #a8007f;">(</span>sort -k 2 $<span style="color: #37474F; font-weight: bold;">cache_dir</span>/Reference.tsv<span style="color: #a8007f;">)</span> | cut -d<span style="color: #FFAB91;">" "</span> -f2<span style="color: #000000;">)</span> &gt; <span style="color: #FFAB91;">\</span>
    $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_edges.tsv
</pre>
</div>
</div>
</div>
