README.org
** Joining key's features to key
#+begin_src bash :tangle ./example/process.sh
  awk '{ print $2,$1 }' < $import_dir/${key}_nodes.tsv > tmp && \
      mv tmp $import_dir/${key}_nodes.tsv
  while IFS=': ' read key_feature value; do
      join -j 1 $import_dir/${key}_nodes.tsv \
          <(sort -k 1b,1 $cache_dir/${key_feature}.tsv) > tmp \
          && mv tmp $import_dir/${key}_nodes.tsv
  done <<< "$(components key_features)"
  sed 's/\s/\t/g' < $import_dir/${key}_nodes.tsv | cut -f 2- > tmp && \
      mv tmp $import_dir/${key}_nodes.tsv
#+end_src

** Cleaning up (replacing temporary separators)
#+begin_src bash :tangle ./example/process.sh
  while IFS=': ' read node value; do
      sed -e 's/ /\t/g' -e "s/$tabsep/\t/g" -e "s/$spcsep/ /g" < $import_dir/${node}_nodes.tsv > tmp && \
          mv tmp $import_dir/${node}_nodes.tsv
  done <<< "$(components nodes)"
#+end_src

** Adding headers
For the key nodes:
#+begin_src bash :tangle ./example/process.sh
  key_value=$(components key)
  key=${key_value%%:*}
  header="${key}Id:ID($key)"
  while IFS=': ' read node value; do
      header="${header}\t${node}"
  done <<< "$(components key_features)"

  cat <(echo -e $header) $import_dir/${key}_nodes.tsv > \
      tmp && mv tmp $import_dir/${key}_nodes.tsv
#+end_src

For other nodes:
#+begin_src bash :tangle ./example/process.sh
  while IFS=': ' read node value; do
      [[ $node == "Reference" ]] && continue
      header="${node}Id:ID(${node})"
      IFS=','; for v in $value; do
          header="${header}\t${v}"
      done

      cat <(echo -e $header) $import_dir/${node}_nodes.tsv > \
          tmp && mv tmp $import_dir/${node}_nodes.tsv
  done <<< "$(components nodes)"
#+end_src

For edges (excluding references):
#+begin_src bash :tangle ./example/process.sh
  while IFS=': ' read node value; do
      [[ $node == "Reference" ]] && continue
      header=":START_ID(${key})"
      header="${header}\t:END_ID(${node})"

      cat <(echo -e $header) $import_dir/${key}_${node}_edges.tsv > \
          tmp && mv tmp $import_dir/${key}_${node}_edges.tsv
  done <<< "$(components nodes)"
#+end_src

For the special case of references, both IDs should be publications:
#+begin_src bash :tangle ./example/process.sh
  header=":START_ID($key)\t:END_ID($key)"
  cat <(echo -e $header) $import_dir/${key}_${key}_edges.tsv > \
      tmp && mv tmp $import_dir/${key}_${key}_edges.tsv
#+end_src

* TODO Example: calculating overlap
:PROPERTIES:
:CUSTOM_ID: example-overlap
:END:

