README.html

<div id="outline-container-orgdd78b6b" class="outline-3">
<h3 id="orgdd78b6b"><span class="section-number-3">2.3.</span> Joining key's features to key</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-bash">awk <span style="color: #FFAB91;">'{ print $2,$1 }'</span> &lt; $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_nodes.tsv &gt; tmp &amp;&amp; <span style="color: #FFAB91;">\</span>
    mv tmp $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_nodes.tsv
<span style="color: #673AB7;">while</span> <span style="color: #37474F; font-weight: bold;">IFS</span>=<span style="color: #FFAB91;">': '</span> read key_feature value; <span style="color: #673AB7;">do</span>
    join -j 1 $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_nodes.tsv <span style="color: #FFAB91;">\</span>
        &lt;<span style="color: #000000;">(</span>sort -k 1b,1 $<span style="color: #37474F; font-weight: bold;">cache_dir</span>/$<span style="color: #a8007f;">{</span><span style="color: #37474F; font-weight: bold;">key_feature</span><span style="color: #a8007f;">}</span>.tsv<span style="color: #000000;">)</span> &gt; tmp <span style="color: #FFAB91;">\</span>
        &amp;&amp; mv tmp $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_nodes.tsv
<span style="color: #673AB7;">done</span> &lt;&lt;&lt; <span style="color: #FFAB91;">"$(components key_features)"</span>
sed <span style="color: #FFAB91;">'s/\s/\t/g'</span> &lt; $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_nodes.tsv | cut -f 2- &gt; tmp &amp;&amp; <span style="color: #FFAB91;">\</span>
    mv tmp $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_nodes.tsv
</pre>
</div>
</div>
</div>

<div id="outline-container-orga19c765" class="outline-3">
<h3 id="orga19c765"><span class="section-number-3">2.4.</span> Cleaning up (replacing temporary separators)</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #673AB7;">while</span> <span style="color: #37474F; font-weight: bold;">IFS</span>=<span style="color: #FFAB91;">': '</span> read node value; <span style="color: #673AB7;">do</span>
    sed -e <span style="color: #FFAB91;">'s/ /\t/g'</span> -e <span style="color: #FFAB91;">"s/$tabsep/\t/g"</span> -e <span style="color: #FFAB91;">"s/$spcsep/ /g"</span> &lt; $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">node</span><span style="color: #000000;">}</span>_nodes.tsv &gt; tmp_$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">node</span><span style="color: #000000;">}</span> &amp;&amp; <span style="color: #FFAB91;">\</span>
        mv tmp_$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">node</span><span style="color: #000000;">}</span> $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">node</span><span style="color: #000000;">}</span>_nodes.tsv &amp;
<span style="color: #673AB7;">done</span> &lt;&lt;&lt; <span style="color: #FFAB91;">"$(components nodes)"</span>
<span style="color: #673AB7;">wait</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac9c7f8" class="outline-3">
<h3 id="orgac9c7f8"><span class="section-number-3">2.5.</span> Adding headers</h3>
<div class="outline-text-3" id="text-2-5">
<p>
For the key nodes:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #37474F; font-weight: bold;">key_value</span>=$<span style="color: #000000;">(</span>components key<span style="color: #000000;">)</span>
<span style="color: #37474F; font-weight: bold;">key</span>=$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key_value</span>%%:*<span style="color: #000000;">}</span>
<span style="color: #37474F; font-weight: bold;">header</span>=<span style="color: #FFAB91;">"${key}Id:ID($key)"</span>
<span style="color: #673AB7;">while</span> <span style="color: #37474F; font-weight: bold;">IFS</span>=<span style="color: #FFAB91;">': '</span> read node value; <span style="color: #673AB7;">do</span>
    <span style="color: #37474F; font-weight: bold;">header</span>=<span style="color: #FFAB91;">"${header}\t${node}"</span>
<span style="color: #673AB7;">done</span> &lt;&lt;&lt; <span style="color: #FFAB91;">"$(components key_features)"</span>

cat &lt;<span style="color: #000000;">(</span><span style="color: #673AB7;">echo</span> -e $<span style="color: #37474F; font-weight: bold;">header</span><span style="color: #000000;">)</span> $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_nodes.tsv &gt; <span style="color: #FFAB91;">\</span>
    tmp &amp;&amp; mv tmp $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_nodes.tsv
</pre>
</div>

<p>
For other nodes:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #673AB7;">while</span> <span style="color: #37474F; font-weight: bold;">IFS</span>=<span style="color: #FFAB91;">': '</span> read node value; <span style="color: #673AB7;">do</span>
    <span style="color: #000000;">[</span><span style="color: #a8007f;">[</span> $<span style="color: #37474F; font-weight: bold;">node</span> == <span style="color: #FFAB91;">"Reference"</span> <span style="color: #a8007f;">]</span><span style="color: #000000;">]</span> &amp;&amp; <span style="color: #673AB7;">continue</span>
    <span style="color: #37474F; font-weight: bold;">header</span>=<span style="color: #FFAB91;">"${node}Id:ID(${node})"</span>
    <span style="color: #37474F; font-weight: bold;">IFS</span>=<span style="color: #FFAB91;">','</span>; <span style="color: #673AB7;">for</span> v<span style="color: #673AB7;"> in</span> $<span style="color: #37474F; font-weight: bold;">value</span>; <span style="color: #673AB7;">do</span>
        <span style="color: #37474F; font-weight: bold;">header</span>=<span style="color: #FFAB91;">"${header}\t${v}"</span>
    <span style="color: #673AB7;">done</span>

    cat &lt;<span style="color: #000000;">(</span><span style="color: #673AB7;">echo</span> -e $<span style="color: #37474F; font-weight: bold;">header</span><span style="color: #000000;">)</span> $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">node</span><span style="color: #000000;">}</span>_nodes.tsv &gt; <span style="color: #FFAB91;">\</span>
        tmp &amp;&amp; mv tmp $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">node</span><span style="color: #000000;">}</span>_nodes.tsv
<span style="color: #673AB7;">done</span> &lt;&lt;&lt; <span style="color: #FFAB91;">"$(components nodes)"</span>
</pre>
</div>

<p>
For edges (excluding references):
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #673AB7;">while</span> <span style="color: #37474F; font-weight: bold;">IFS</span>=<span style="color: #FFAB91;">': '</span> read node value; <span style="color: #673AB7;">do</span>
    <span style="color: #000000;">[</span><span style="color: #a8007f;">[</span> $<span style="color: #37474F; font-weight: bold;">node</span> == <span style="color: #FFAB91;">"Reference"</span> <span style="color: #a8007f;">]</span><span style="color: #000000;">]</span> &amp;&amp; <span style="color: #673AB7;">continue</span>
    <span style="color: #37474F; font-weight: bold;">header</span>=<span style="color: #FFAB91;">":START_ID(${key})"</span>
    <span style="color: #37474F; font-weight: bold;">header</span>=<span style="color: #FFAB91;">"${header}\t:END_ID(${node})"</span>

    cat &lt;<span style="color: #000000;">(</span><span style="color: #673AB7;">echo</span> -e $<span style="color: #37474F; font-weight: bold;">header</span><span style="color: #000000;">)</span> $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">node</span><span style="color: #000000;">}</span>_edges.tsv &gt; <span style="color: #FFAB91;">\</span>
        tmp &amp;&amp; mv tmp $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">node</span><span style="color: #000000;">}</span>_edges.tsv
<span style="color: #673AB7;">done</span> &lt;&lt;&lt; <span style="color: #FFAB91;">"$(components nodes)"</span>
</pre>
</div>

<p>
For the special case of references, both IDs should be publications:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #37474F; font-weight: bold;">header</span>=<span style="color: #FFAB91;">":START_ID($key)\t:END_ID($key)"</span>
cat &lt;<span style="color: #000000;">(</span><span style="color: #673AB7;">echo</span> -e $<span style="color: #37474F; font-weight: bold;">header</span><span style="color: #000000;">)</span> $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_edges.tsv &gt; <span style="color: #FFAB91;">\</span>
    tmp &amp;&amp; mv tmp $<span style="color: #37474F; font-weight: bold;">import_dir</span>/$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_$<span style="color: #000000;">{</span><span style="color: #37474F; font-weight: bold;">key</span><span style="color: #000000;">}</span>_edges.tsv
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-example-overlap" class="outline-2">
<h2 id="example-overlap"><span class="section-number-2">3.</span> <span class="todo TODO">TODO</span> Example: calculating overlap</h2>
<div class="outline-text-2" id="text-example-overlap">
</div>
</div>
