README.html

<div id="outline-container-orgfcedd02" class="outline-2">
<h2 id="orgfcedd02"><span class="section-number-2">4.</span> Example: importing with neo4j</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #37474F; font-weight: bold;">import_file</span>=example/importpubmed.sh
cat &gt; $<span style="color: #37474F; font-weight: bold;">import_file</span> &lt;&lt;_EOF_
<span style="color: #2544bb;">#!/usr/bin/env bash</span>

<span style="color: #2544bb;">database_dir=\$XDG_DATA_HOME/neo4j/data</span>
<span style="color: #2544bb;">import_dir=$import_dir</span>
<span style="color: #2544bb;">name=neo4j</span>

<span style="color: #2544bb;">[ -d \$database_dir ] &amp;&amp; rm -r \$database_dir</span>

<span style="color: #2544bb;">neo4j-admin import \\</span>
<span style="color: #2544bb;">    --database=\$name \\</span>
<span style="color: #2544bb;">    --delimiter="\\t" \\</span>
<span style="color: #2544bb;">    --quote="\\"" \\</span>
<span style="color: #2544bb;">    --skip-bad-relationships=true \\</span>
<span style="color: #2544bb;">    --trim-strings=true \\</span>
<span style="color: #2544bb;">    --id-type=STRING \\</span>
<span style="color: #2544bb;">_EOF_</span>

<span style="color: #673AB7;">while</span> <span style="color: #37474F; font-weight: bold;">IFS</span>=<span style="color: #FFAB91;">': '</span> read node value; <span style="color: #673AB7;">do</span>
    <span style="color: #000000;">[</span><span style="color: #a8007f;">[</span> $<span style="color: #37474F; font-weight: bold;">node</span> == <span style="color: #FFAB91;">"Reference"</span> <span style="color: #a8007f;">]</span><span style="color: #000000;">]</span> &amp;&amp; <span style="color: #673AB7;">continue</span>
    <span style="color: #673AB7;">echo</span> <span style="color: #FFAB91;">"    --nodes=${node}=\$import_dir/${node}_nodes.tsv \\"</span> &gt;&gt; $<span style="color: #37474F; font-weight: bold;">import_file</span>
    <span style="color: #673AB7;">echo</span> <span style="color: #FFAB91;">"    --relationships=${key}-${node}=\$import_dir/${key}_${node}_edges.tsv \\"</span> &gt;&gt; $<span style="color: #37474F; font-weight: bold;">import_file</span>
<span style="color: #673AB7;">done</span> &lt;&lt;&lt; <span style="color: #FFAB91;">"$(components nodes)"</span>

<span style="color: #673AB7;">echo</span> <span style="color: #FFAB91;">"    --nodes=${key}=\$import_dir/${key}_nodes.tsv \\"</span> &gt;&gt; $<span style="color: #37474F; font-weight: bold;">import_file</span>
<span style="color: #673AB7;">echo</span> <span style="color: #FFAB91;">"    --relationships=${key}-${key}=\$import_dir/${key}_${key}_edges.tsv"</span> &gt;&gt; $<span style="color: #37474F; font-weight: bold;">import_file</span>

chmod +x $<span style="color: #37474F; font-weight: bold;">import_file</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David R. Connell</p>
<p class="date">Created: 2022-04-21 Thu 23:08</p>
</div>
</body>
</html>
